{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/',guid(parameters('workspace'), 'Sign-In-From-Unusual-Location'))]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',guid(parameters('workspace'), 'Sign-In-From-Unusual-Location'))]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "Sign In from an Unusual Location",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "// Define a list of known/approved country codes from the Sentinel watchlist \"knownLocations\".\r\nlet knownLocations = (_GetWatchlist('knownLocations') | project CountryCode);\r\n// Build a lookup of each user's last successful sign-in from a known location in the last 30 days.\r\nlet lastKnownLocation = SigninLogs\r\n| where ResultSignature == \"SUCCESS\"\r\n| where Location in (knownLocations)\r\n| where TimeGenerated > ago(30d)\r\n| summarize LastKnownSignInTime = max(TimeGenerated) by UserPrincipalName, LastKnownLocation = Location;\r\nSigninLogs\r\n// Only include sign-ins from locations NOT in the known locations watchlist.\r\n| where Location !in (knownLocations)\r\n// Only include successful sign-ins.\r\n| where ResultSignature == \"SUCCESS\"\r\n// Enrich with the user's last known good location and when they were last seen there.\r\n| join kind=leftouter lastKnownLocation on UserPrincipalName\r\n// Return only the relevant columns.\r\n| project\r\n    TimeGenerated,\r\n    Identity,\r\n    UserDisplayName,\r\n    UserPrincipalName,\r\n    UserType,\r\n    Location,\r\n    AppDisplayName,\r\n    AuthenticationRequirement,\r\n    ClientAppUsed,\r\n    ConditionalAccessStatus,\r\n    IsInteractive,\r\n    IPAddress,\r\n    LocationDetails",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H5M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "InitialAccess"
                ],
                "techniques": [
                    "T1078"
                ],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": true,
                        "lookbackDuration": "PT8H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "UserDisplayName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}
