{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/',guid(parameters('workspace'), 'Unauthorised-Web-Browsers-v2'))]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',guid(parameters('workspace'), 'Unauthorised-Web-Browsers-v2'))]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "Unauthorised Web Browser Detected",
                "description": "Detects the use of unauthorised web browsers being used",
                "severity": "Medium",
                "enabled": true,
                "query": "// Creates a list of browsers you want to be alerted on.\r\nlet browsers = dynamic([\"browser1.exe\", \"browser2.exe\", \"browser3.exe\"]);\r\n// Looks for a browser being opened in the DeviceProcessEvents table.\r\nlet BrowserProcessEvents = DeviceProcessEvents\r\n| where FileName has_any (browsers)\r\n    or ProcessCommandLine has_any (browsers)\r\n| extend DetectionSource = \"DeviceProcessEvents\"\r\n| project TimeGenerated, DeviceName, AccountName, DetectionSource, FileName, ProcessCommandLine, FolderPath, SHA256, InitiatingProcessFileName, InitiatingProcessCommandLine;\r\n// Looks for a browser being opened in the DeviceEvents table.\r\nlet BrowserDeviceEvents = DeviceEvents\r\n| where FileName has_any (browsers)\r\n    or ProcessCommandLine has_any (browsers)\r\n| extend DetectionSource = \"DeviceEvents\"\r\n| project TimeGenerated, DeviceName, AccountName, DetectionSource, FileName, ProcessCommandLine, FolderPath, SHA256, InitiatingProcessFileName, InitiatingProcessCommandLine;\r\n// Looks for a browser being opened in the DeviceNetworkEvents table.\r\nlet BrowserNetworkEvents = DeviceNetworkEvents\r\n| where InitiatingProcessFileName has_any (browsers)\r\n| extend DetectionSource = \"DeviceNetworkEvents\"\r\n| project TimeGenerated, DeviceName, DetectionSource, InitiatingProcessAccountName, InitiatingProcessFileName, InitiatingProcessCommandLine;\r\n// Summarizes the results.\r\nBrowserProcessEvents\r\n| union BrowserDeviceEvents\r\n| union BrowserNetworkEvents\r\n| summarize \r\n    FirstSeen = min(TimeGenerated),\r\n    LastSeen = max(TimeGenerated),\r\n    EventCount = count()\r\n    by DeviceName, AccountName, FileName, SHA256, InitiatingProcessFileName\r\n| sort by LastSeen desc",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H5M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT4H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Host"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "DeviceName"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "AccountName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}
